Benjamin-girard-1/geophys_acquisition_module/version_2/firmware/sdkconfig.defaults
# Target: ESP32-S3-DevKitC-1-N8R8 / ESP32-S3-WROOM-1-N8R8
CONFIG_IDF_TARGET="esp32s3"

# 8 MB Quad SPI flash
# CONFIG_ESPTOOLPY_FLASH_MODE_AUTO_DETECT is not set
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y

# 8 MB Octal SPI PSRAM
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_CAPS_ALLOC=y
CONFIG_SPIRAM_MEMTEST=y
# CONFIG_SPIRAM_IGNORE_NOTFOUND is not set

# Keep peripheral clocks fixed during milestone-1 acquisition and UART streaming.
# CONFIG_PM_ENABLE is not set

# The ADC data-ready ISR timestamps each conversion from the monotonic clock.
CONFIG_ESP_TIMER_IN_IRAM=y

# UART0 is reserved for the framed binary host protocol. Do not allow ESP-IDF,
# printf, or a secondary USB Serial/JTAG console to inject text into that link.
CONFIG_ESP_CONSOLE_NONE=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y

# Normal diagnostics are structured protocol messages, not console text.
CONFIG_BOOTLOADER_LOG_LEVEL_NONE=y
CONFIG_LOG_DEFAULT_LEVEL_NONE=y
CONFIG_LOG_MAXIMUM_EQUALS_DEFAULT=y
CONFIG_ESP_SYSTEM_PANIC_SILENT_REBOOT=y

# Keep the reversible factory ROM-log behavior. The host parser must discard
# reset-time ROM bytes until it finds a valid V2 frame; never burn an eFuse just
# to silence this output.
CONFIG_BOOT_ROM_LOG_ALWAYS_ON=y
